{
  "backend/main.mo": "Motoko actor defining the appointment management backend with role-based access control, supporting create, update, delete, and query operations on per-principal appointment lists.",
  "feature_evidence.json": "JSON report mapping feature IDs and titles to the frontend files and components that implement them, along with test IDs and confidence levels.",
  "frontend-file-summaries.txt": "JSON object providing one-line descriptions of each frontend source file, summarizing their purpose and key functionality.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Enrich Ladies Beauty Parlour' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes including splash, login, owner, and customer pages.",
  "frontend/src/components/AppointmentChatBox.tsx": "Modal chat component for messaging between owner and customer on a specific appointment, appending new messages to the appointment's chat history via the update mutation.",
  "frontend/src/components/CustomerLayout.tsx": "Shared layout wrapper for customer-facing pages providing a sticky header with logo, user name, a dropdown navigation menu, and an optional floating 'Book Appointment' button.",
  "frontend/src/components/OwnerLayout.tsx": "Defines the OwnerLayout wrapper component with a sticky purple header (logo, title, dropdown navigation menu) and footer, used across owner dashboard pages.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating backend data (user role, appointments), wrapping actor calls with loading and caching logic.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base/component/utility layers, CSS custom properties for a purple luxury color palette, and splash/page transition animations.",
  "frontend/src/lib/authStore.ts": "Simple email/password auth store using sessionStorage and localStorage, supporting owner login with hardcoded credentials and customer sign-up/login.",
  "frontend/src/lib/localStore.ts": "localStorage utility module providing typed getters and setters for salon data (services, holidays, reviews, announcements, profile, theme) with default values.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BookAppointment.tsx": "Multi-step appointment booking form (service selection, date/time, contact details) that submits a new appointment to the backend and redirects to a confirmation page. Redirects unauthenticated users to login.",
  "frontend/src/pages/BookingConfirmation.tsx": "Displays a confirmation screen after a successful appointment booking, showing all booking details (service, date, time, contact info) retrieved from local store. Redirects to dashboard if no booking data is found.",
  "frontend/src/pages/CustomerDashboard.tsx": "Customer-facing home page showing a hero banner, announcements, quick-action buttons, and a preview of featured services. Redirects unauthenticated users to login.",
  "frontend/src/pages/CustomerProfile.tsx": "Displays the logged-in customer's account information and their appointment history with status badges, and provides a logout button. Redirects unauthenticated users to login.",
  "frontend/src/pages/CustomerReviews.tsx": "Allows customers to submit star ratings and written reviews, and displays existing reviews separated into the user's own and others'. Reviews are persisted via local store.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login/signup page with email-password authentication and Google/Microsoft stub handlers, navigating users to owner or customer dashboards based on their role.",
  "frontend/src/pages/ManageServices.tsx": "Owner-only page for viewing, adding, editing, and deleting salon services stored in localStore, with inline edit forms and discount calculation.",
  "frontend/src/pages/OurServices.tsx": "Customer-facing page that displays all salon services grouped by category with pricing, discounts, and a button to navigate to the booking page.",
  "frontend/src/pages/OwnerAppointmentsOfDay.tsx": "Owner page listing appointments filtered by today or all dates, allowing status updates via a dropdown and opening a chat box per appointment.",
  "frontend/src/pages/OwnerDashboard.tsx": "Owner dashboard showing today's appointment count, quick-action navigation tiles, announcement posting, and holiday date management using localStore.",
  "frontend/src/pages/OwnerProfile.tsx": "Owner profile page that displays and allows inline editing of business information fields (name, contact, address, email) persisted via localStore.",
  "frontend/src/pages/OwnerReviews.tsx": "Owner-facing page that displays customer reviews with star ratings and allows the owner to post or update replies to each review, persisting changes to localStore.",
  "frontend/src/pages/SplashScreen.tsx": "Animated splash screen showing the salon logo, name, and loading dots, which auto-navigates to the login page after 2.8 seconds.",
  "frontend/src/pages/ThemeCustomization.tsx": "Owner page for selecting from a large palette of named color themes (e.g., Royal Purple, Rose Gold) to customize the salon app's appearance, saving the choice to localStore.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL query parameters (including from hash-based routes), persist them to sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Cormorant Garamond), OKLCH-based design tokens, luxury box shadows, and fade/slide/scale keyframe animations.",
  "project_state.json": "Project state manifest describing the app's architecture, feature list, image requirements, known issues, and role-based access rules for the Enrich Ladies Beauty Parlour web application."
}